espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25a221f1920im56.h
/**************************************************************************//**
 * @file
 * @brief CMSIS Cortex-M Peripheral Access Layer Header File
 *        for EFR32FG25A221F1920IM56
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25A221F1920IM56_H
#define EFR32FG25A221F1920IM56_H

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************//**
 * @addtogroup Parts
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * @defgroup EFR32FG25A221F1920IM56 EFR32FG25A221F1920IM56
 * @{
 *****************************************************************************/

/** Interrupt Number Definition */
typedef enum IRQn{
  /******  Cortex-M Processor Exceptions Numbers ******************************************/
  NonMaskableInt_IRQn    = -14,             /*!< -14 Cortex-M Non Maskable Interrupt      */
  HardFault_IRQn         = -13,             /*!< -13 Cortex-M Hard Fault Interrupt        */
  MemoryManagement_IRQn  = -12,             /*!< -12 Cortex-M Memory Management Interrupt */
  BusFault_IRQn          = -11,             /*!< -11 Cortex-M Bus Fault Interrupt         */
  UsageFault_IRQn        = -10,             /*!< -10 Cortex-M Usage Fault Interrupt       */
  SVCall_IRQn            = -5,              /*!< -5  Cortex-M SV Call Interrupt           */
  DebugMonitor_IRQn      = -4,              /*!< -4  Cortex-M Debug Monitor Interrupt     */
  PendSV_IRQn            = -2,              /*!< -2  Cortex-M Pend SV Interrupt           */
  SysTick_IRQn           = -1,              /*!< -1  Cortex-M System Tick Interrupt       */

  /******  EFR32FG25 Peripheral Interrupt Numbers ******************************************/

  SMU_SECURE_IRQn        = 0,  /*!<  0 EFR32 SMU_SECURE Interrupt */
  SMU_S_PRIVILEGED_IRQn  = 1,  /*!<  1 EFR32 SMU_S_PRIVILEGED Interrupt */
  SMU_NS_PRIVILEGED_IRQn = 2,  /*!<  2 EFR32 SMU_NS_PRIVILEGED Interrupt */
  EMU_IRQn               = 3,  /*!<  3 EFR32 EMU Interrupt */
  TIMER0_IRQn            = 4,  /*!<  4 EFR32 TIMER0 Interrupt */
  TIMER1_IRQn            = 5,  /*!<  5 EFR32 TIMER1 Interrupt */
  TIMER2_IRQn            = 6,  /*!<  6 EFR32 TIMER2 Interrupt */
  TIMER3_IRQn            = 7,  /*!<  7 EFR32 TIMER3 Interrupt */
  ETAMPDET_IRQn          = 8,  /*!<  8 EFR32 ETAMPDET Interrupt */
  TIMER4_IRQn            = 9,  /*!<  9 EFR32 TIMER4 Interrupt */
  TIMER5_IRQn            = 10, /*!< 10 EFR32 TIMER5 Interrupt */
  TIMER6_IRQn            = 11, /*!< 11 EFR32 TIMER6 Interrupt */
  TIMER7_IRQn            = 12, /*!< 12 EFR32 TIMER7 Interrupt */
  EUSART0_RX_IRQn        = 13, /*!< 13 EFR32 EUSART0_RX Interrupt */
  EUSART0_TX_IRQn        = 14, /*!< 14 EFR32 EUSART0_TX Interrupt */
  EUSART1_RX_IRQn        = 15, /*!< 15 EFR32 EUSART1_RX Interrupt */
  EUSART1_TX_IRQn        = 16, /*!< 16 EFR32 EUSART1_TX Interrupt */
  EUSART2_RX_IRQn        = 17, /*!< 17 EFR32 EUSART2_RX Interrupt */
  EUSART2_TX_IRQn        = 18, /*!< 18 EFR32 EUSART2_TX Interrupt */
  EUSART3_RX_IRQn        = 19, /*!< 19 EFR32 EUSART3_RX Interrupt */
  EUSART3_TX_IRQn        = 20, /*!< 20 EFR32 EUSART3_TX Interrupt */
  EUSART4_RX_IRQn        = 21, /*!< 21 EFR32 EUSART4_RX Interrupt */
  EUSART4_TX_IRQn        = 22, /*!< 22 EFR32 EUSART4_TX Interrupt */
  ICACHE0_IRQn           = 23, /*!< 23 EFR32 ICACHE0 Interrupt */
  BURTC_IRQn             = 24, /*!< 24 EFR32 BURTC Interrupt */
  LETIMER0_IRQn          = 25, /*!< 25 EFR32 LETIMER0 Interrupt */
  SYSCFG_IRQn            = 26, /*!< 26 EFR32 SYSCFG Interrupt */
  MPAHBRAM_IRQn          = 27, /*!< 27 EFR32 MPAHBRAM Interrupt */
  LDMA_IRQn              = 28, /*!< 28 EFR32 LDMA Interrupt */
  LFXO_IRQn              = 29, /*!< 29 EFR32 LFXO Interrupt */
  LFRCO_IRQn             = 30, /*!< 30 EFR32 LFRCO Interrupt */
  ULFRCO_IRQn            = 31, /*!< 31 EFR32 ULFRCO Interrupt */
  GPIO_ODD_IRQn          = 32, /*!< 32 EFR32 GPIO_ODD Interrupt */
  GPIO_EVEN_IRQn         = 33, /*!< 33 EFR32 GPIO_EVEN Interrupt */
  I2C0_IRQn              = 34, /*!< 34 EFR32 I2C0 Interrupt */
  I2C1_IRQn              = 35, /*!< 35 EFR32 I2C1 Interrupt */
  EMUDG_IRQn             = 36, /*!< 36 EFR32 EMUDG Interrupt */
  AGC_IRQn               = 37, /*!< 37 EFR32 AGC Interrupt */
  BUFC_IRQn              = 38, /*!< 38 EFR32 BUFC Interrupt */
  FRC_PRI_IRQn           = 39, /*!< 39 EFR32 FRC_PRI Interrupt */
  FRC_IRQn               = 40, /*!< 40 EFR32 FRC Interrupt */
  MODEM_IRQn             = 41, /*!< 41 EFR32 MODEM Interrupt */
  PROTIMER_IRQn          = 42, /*!< 42 EFR32 PROTIMER Interrupt */
  RAC_RSM_IRQn           = 43, /*!< 43 EFR32 RAC_RSM Interrupt */
  RAC_SEQ_IRQn           = 44, /*!< 44 EFR32 RAC_SEQ Interrupt */
  HOSTMAILBOX_IRQn       = 45, /*!< 45 EFR32 HOSTMAILBOX Interrupt */
  SYNTH_IRQn             = 46, /*!< 46 EFR32 SYNTH Interrupt */
  ACMP0_IRQn             = 47, /*!< 47 EFR32 ACMP0 Interrupt */
  ACMP1_IRQn             = 48, /*!< 48 EFR32 ACMP1 Interrupt */
  WDOG0_IRQn             = 49, /*!< 49 EFR32 WDOG0 Interrupt */
  WDOG1_IRQn             = 50, /*!< 50 EFR32 WDOG1 Interrupt */
  HFXO0_IRQn             = 51, /*!< 51 EFR32 HFXO0 Interrupt */
  HFRCO0_IRQn            = 52, /*!< 52 EFR32 HFRCO0 Interrupt */
  HFRCOEM23_IRQn         = 53, /*!< 53 EFR32 HFRCOEM23 Interrupt */
  CMU_IRQn               = 54, /*!< 54 EFR32 CMU Interrupt */
  AES_IRQn               = 55, /*!< 55 EFR32 AES Interrupt */
  IADC_IRQn              = 56, /*!< 56 EFR32 IADC Interrupt */
  MSC_IRQn               = 57, /*!< 57 EFR32 MSC Interrupt */
  DPLL0_IRQn             = 58, /*!< 58 EFR32 DPLL0 Interrupt */
  DCDC_IRQn              = 60, /*!< 60 EFR32 DCDC Interrupt */
  VDAC_IRQn              = 61, /*!< 61 EFR32 VDAC Interrupt */
  PCNT0_IRQn             = 62, /*!< 62 EFR32 PCNT0 Interrupt */
  USB_IRQn               = 63, /*!< 63 EFR32 USB Interrupt */
  SW0_IRQn               = 64, /*!< 64 EFR32 SW0 Interrupt */
  SW1_IRQn               = 65, /*!< 65 EFR32 SW1 Interrupt */
  SW2_IRQn               = 66, /*!< 66 EFR32 SW2 Interrupt */
  SW3_IRQn               = 67, /*!< 67 EFR32 SW3 Interrupt */
  KERNEL0_IRQn           = 68, /*!< 68 EFR32 KERNEL0 Interrupt */
  KERNEL1_IRQn           = 69, /*!< 69 EFR32 KERNEL1 Interrupt */
  M33CTI0_IRQn           = 70, /*!< 70 EFR32 M33CTI0 Interrupt */
  M33CTI1_IRQn           = 71, /*!< 71 EFR32 M33CTI1 Interrupt */
  FPUEXH_IRQn            = 72, /*!< 72 EFR32 FPUEXH Interrupt */
  SEMBRX_IRQn            = 74, /*!< 74 EFR32 SEMBRX Interrupt */
  SEMBTX_IRQn            = 75, /*!< 75 EFR32 SEMBTX Interrupt */
  LESENSE_IRQn           = 76, /*!< 76 EFR32 LESENSE Interrupt */
  SYSRTC_APP_IRQn        = 77, /*!< 77 EFR32 SYSRTC_APP Interrupt */
  SYSRTC_SEQ_IRQn        = 78, /*!< 78 EFR32 SYSRTC_SEQ Interrupt */
  RFECA0_IRQn            = 79, /*!< 79 EFR32 RFECA0 Interrupt */
  RFECA1_IRQn            = 80, /*!< 80 EFR32 RFECA1 Interrupt */
  RFFPLL_IRQn            = 81, /*!< 81 EFR32 RFFPLL Interrupt */
  USBPLL0_IRQn           = 82, /*!< 82 EFR32 USBPLL0 Interrupt */
  AHB2AHB0_IRQn          = 83, /*!< 83 EFR32 AHB2AHB0 Interrupt */
  AHB2AHB1_IRQn          = 84, /*!< 84 EFR32 AHB2AHB1 Interrupt */
  AHB2AHB2_IRQn          = 85, /*!< 85 EFR32 AHB2AHB2 Interrupt */
  AHB2AHB3_IRQn          = 86, /*!< 86 EFR32 AHB2AHB3 Interrupt */
  RFTIMER_IRQn           = 87, /*!< 87 EFR32 RFTIMER Interrupt */
  SOFTM_IRQn             = 88, /*!< 88 EFR32 SOFTM Interrupt */
  RFLDMA_IRQn            = 89, /*!< 89 EFR32 RFLDMA Interrupt */
} IRQn_Type;

/**************************************************************************//**
 * @defgroup EFR32FG25A221F1920IM56_Core EFR32FG25A221F1920IM56 Core
 * @{
 * @brief Processor and Core Peripheral Section
 *****************************************************************************/

#define __CM33_REV                0x0004U /**< Cortex-M33 Core revision */
#define __DSP_PRESENT             1U      /**< Presence of DSP  */
#define __FPU_PRESENT             1U      /**< Presence of FPU  */
#define __MPU_PRESENT             1U      /**< Presence of MPU  */
#define __SAUREGION_PRESENT       1U      /**< Presence of FPU  */
#define __TZ_PRESENT              1U      /**< Presence of TrustZone */
#define __VTOR_PRESENT            1U      /**< Presence of VTOR register in SCB  */
#define __NVIC_PRIO_BITS          4U      /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0U      /**< Is 1 if different SysTick counter is used */

/** @} End of group EFR32FG25A221F1920IM56_Core */

/**************************************************************************//**
* @defgroup EFR32FG25A221F1920IM56_Part EFR32FG25A221F1920IM56 Part
* @{
******************************************************************************/

